# ●システム効果音定義ファイル
#
# 定義方法：
#   タグ				効果音なし
#   タグ = ファイル			効果音ファイル指定
#   タグ = ファイル : チャンネル(～9)	チャンネルつき効果音指定
#   タグ = @タグ			エイリアス
# 
# 先頭が「#」はコメントです。行頭と行末の空白は無視されます。
# タグは大文字小文字を区別しません。
#
# タグについて：
# 「.」で区切られた階層構造概念があり，
# 「*」を指定するとその階層以下のデフォルトの指定となります。
#
#    *           = 全てのデフォルト
#    menu.*      = ウィンドウメニュー以下のデフォルト
#    menu.file.* = ファイルメニュー以下のデフォルト
#
# エイリアスについて：
#    @ タグ，で別のタグの設定をコピーします。
#    エイリアス同士がリング状でつながると無限ループになるので注意。
#
#
# uipsd.funcでの 効果音設定例
# eval,names,call,uiloadSysSE,セクション名

# 汎用効果音定義
#
ok     = sys_onclick : 10
cancel = 
select = sys_onmouse : 11
page   = @ok

success = sys_ok : 10
failure = sys_no : 10


# 汎用ルール
*.enter       = @select
*.click       = @ok
*.nose.enter  
*.nose.click  
*.noclick.click
*.close.click 
*.back.click  
*.open        = @ok
*.back        = @cancel
*.close       = @cancel

*.slider.enter
*.slider.click = @page
*.page.click   = @page



# 個別上書きルール

message.vreplay.click
backlog.vreplay.click

option.chvol.enter
option.chvol.click
option.test.click

option.speaker.click

#option.sysse.enter
option.sysse.click = @success

setest = SE01_A096A : 9
option.setest.click = @setest
option.sevol.enter
option.sevol.click  = @setest

soundmode.item.enter
soundmode.item.click

soundmode.ctrl.enter
soundmode.ctrl.click

cgmode.next   = @ok
cgmode.cancel = @ok


# 音量確認ボイス

voicetest.a01    = a01_00035
voicetest.a02    = a02_00008
voicetest.a03    = a03_00025
voicetest.a04    = a04_00009
voicetest.a05    = a05_00011
voicetest.a06    = a06_00011
voicetest.others = b02_00002
